{"weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"shape": [8], "name": "batch_normalization_1/gamma", "dtype": "float32"}, {"shape": [8], "name": "batch_normalization_1/beta", "dtype": "float32"}, {"shape": [8], "name": "batch_normalization_1/moving_mean", "dtype": "float32"}, {"shape": [8], "name": "batch_normalization_1/moving_variance", "dtype": "float32"}]}, {"paths": ["group2-shard1of1"], "weights": [{"shape": [64], "name": "batch_normalization_10/gamma", "dtype": "float32"}, {"shape": [64], "name": "batch_normalization_10/beta", "dtype": "float32"}, {"shape": [64], "name": "batch_normalization_10/moving_mean", "dtype": "float32"}, {"shape": [64], "name": "batch_normalization_10/moving_variance", "dtype": "float32"}]}, {"paths": ["group3-shard1of1"], "weights": [{"shape": [64], "name": "batch_normalization_11/gamma", "dtype": "float32"}, {"shape": [64], "name": "batch_normalization_11/beta", "dtype": "float32"}, {"shape": [64], "name": "batch_normalization_11/moving_mean", "dtype": "float32"}, {"shape": [64], "name": "batch_normalization_11/moving_variance", "dtype": "float32"}]}, {"paths": ["group4-shard1of1"], "weights": [{"shape": [128], "name": "batch_normalization_12/gamma", "dtype": "float32"}, {"shape": [128], "name": "batch_normalization_12/beta", "dtype": "float32"}, {"shape": [128], "name": "batch_normalization_12/moving_mean", "dtype": "float32"}, {"shape": [128], "name": "batch_normalization_12/moving_variance", "dtype": "float32"}]}, {"paths": ["group5-shard1of1"], "weights": [{"shape": [128], "name": "batch_normalization_13/gamma", "dtype": "float32"}, {"shape": [128], "name": "batch_normalization_13/beta", "dtype": "float32"}, {"shape": [128], "name": "batch_normalization_13/moving_mean", "dtype": "float32"}, {"shape": [128], "name": "batch_normalization_13/moving_variance", "dtype": "float32"}]}, {"paths": ["group6-shard1of1"], "weights": [{"shape": [128], "name": "batch_normalization_14/gamma", "dtype": "float32"}, {"shape": [128], "name": "batch_normalization_14/beta", "dtype": "float32"}, {"shape": [128], "name": "batch_normalization_14/moving_mean", "dtype": "float32"}, {"shape": [128], "name": "batch_normalization_14/moving_variance", "dtype": "float32"}]}, {"paths": ["group7-shard1of1"], "weights": [{"shape": [8], "name": "batch_normalization_2/gamma", "dtype": "float32"}, {"shape": [8], "name": "batch_normalization_2/beta", "dtype": "float32"}, {"shape": [8], "name": "batch_normalization_2/moving_mean", "dtype": "float32"}, {"shape": [8], "name": "batch_normalization_2/moving_variance", "dtype": "float32"}]}, {"paths": ["group8-shard1of1"], "weights": [{"shape": [16], "name": "batch_normalization_3/gamma", "dtype": "float32"}, {"shape": [16], "name": "batch_normalization_3/beta", "dtype": "float32"}, {"shape": [16], "name": "batch_normalization_3/moving_mean", "dtype": "float32"}, {"shape": [16], "name": "batch_normalization_3/moving_variance", "dtype": "float32"}]}, {"paths": ["group9-shard1of1"], "weights": [{"shape": [16], "name": "batch_normalization_4/gamma", "dtype": "float32"}, {"shape": [16], "name": "batch_normalization_4/beta", "dtype": "float32"}, {"shape": [16], "name": "batch_normalization_4/moving_mean", "dtype": "float32"}, {"shape": [16], "name": "batch_normalization_4/moving_variance", "dtype": "float32"}]}, {"paths": ["group10-shard1of1"], "weights": [{"shape": [16], "name": "batch_normalization_5/gamma", "dtype": "float32"}, {"shape": [16], "name": "batch_normalization_5/beta", "dtype": "float32"}, {"shape": [16], "name": "batch_normalization_5/moving_mean", "dtype": "float32"}, {"shape": [16], "name": "batch_normalization_5/moving_variance", "dtype": "float32"}]}, {"paths": ["group11-shard1of1"], "weights": [{"shape": [32], "name": "batch_normalization_6/gamma", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_6/beta", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_6/moving_mean", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_6/moving_variance", "dtype": "float32"}]}, {"paths": ["group12-shard1of1"], "weights": [{"shape": [32], "name": "batch_normalization_7/gamma", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_7/beta", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_7/moving_mean", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_7/moving_variance", "dtype": "float32"}]}, {"paths": ["group13-shard1of1"], "weights": [{"shape": [32], "name": "batch_normalization_8/gamma", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_8/beta", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_8/moving_mean", "dtype": "float32"}, {"shape": [32], "name": "batch_normalization_8/moving_variance", "dtype": "float32"}]}, {"paths": ["group14-shard1of1"], "weights": [{"shape": [64], "name": "batch_normalization_9/gamma", "dtype": "float32"}, {"shape": [64], "name": "batch_normalization_9/beta", "dtype": "float32"}, {"shape": [64], "name": "batch_normalization_9/moving_mean", "dtype": "float32"}, {"shape": [64], "name": "batch_normalization_9/moving_variance", "dtype": "float32"}]}, {"paths": ["group15-shard1of1"], "weights": [{"shape": [3, 3, 1, 8], "name": "conv2d_1/kernel", "dtype": "float32"}]}, {"paths": ["group16-shard1of1"], "weights": [{"shape": [3, 3, 8, 8], "name": "conv2d_2/kernel", "dtype": "float32"}]}, {"paths": ["group17-shard1of1"], "weights": [{"shape": [1, 1, 8, 16], "name": "conv2d_3/kernel", "dtype": "float32"}]}, {"paths": ["group18-shard1of1"], "weights": [{"shape": [1, 1, 16, 32], "name": "conv2d_4/kernel", "dtype": "float32"}]}, {"paths": ["group19-shard1of1"], "weights": [{"shape": [1, 1, 32, 64], "name": "conv2d_5/kernel", "dtype": "float32"}]}, {"paths": ["group20-shard1of1"], "weights": [{"shape": [1, 1, 64, 128], "name": "conv2d_6/kernel", "dtype": "float32"}]}, {"paths": ["group21-shard1of1"], "weights": [{"shape": [3, 3, 128, 7], "name": "conv2d_7/kernel", "dtype": "float32"}, {"shape": [7], "name": "conv2d_7/bias", "dtype": "float32"}]}, {"paths": ["group22-shard1of1"], "weights": [{"shape": [3, 3, 8, 1], "name": "separable_conv2d_1/depthwise_kernel", "dtype": "float32"}, {"shape": [1, 1, 8, 16], "name": "separable_conv2d_1/pointwise_kernel", "dtype": "float32"}]}, {"paths": ["group23-shard1of1"], "weights": [{"shape": [3, 3, 16, 1], "name": "separable_conv2d_2/depthwise_kernel", "dtype": "float32"}, {"shape": [1, 1, 16, 16], "name": "separable_conv2d_2/pointwise_kernel", "dtype": "float32"}]}, {"paths": ["group24-shard1of1"], "weights": [{"shape": [3, 3, 16, 1], "name": "separable_conv2d_3/depthwise_kernel", "dtype": "float32"}, {"shape": [1, 1, 16, 32], "name": "separable_conv2d_3/pointwise_kernel", "dtype": "float32"}]}, {"paths": ["group25-shard1of1"], "weights": [{"shape": [3, 3, 32, 1], "name": "separable_conv2d_4/depthwise_kernel", "dtype": "float32"}, {"shape": [1, 1, 32, 32], "name": "separable_conv2d_4/pointwise_kernel", "dtype": "float32"}]}, {"paths": ["group26-shard1of1"], "weights": [{"shape": [3, 3, 32, 1], "name": "separable_conv2d_5/depthwise_kernel", "dtype": "float32"}, {"shape": [1, 1, 32, 64], "name": "separable_conv2d_5/pointwise_kernel", "dtype": "float32"}]}, {"paths": ["group27-shard1of1"], "weights": [{"shape": [3, 3, 64, 1], "name": "separable_conv2d_6/depthwise_kernel", "dtype": "float32"}, {"shape": [1, 1, 64, 64], "name": "separable_conv2d_6/pointwise_kernel", "dtype": "float32"}]}, {"paths": ["group28-shard1of1"], "weights": [{"shape": [3, 3, 64, 1], "name": "separable_conv2d_7/depthwise_kernel", "dtype": "float32"}, {"shape": [1, 1, 64, 128], "name": "separable_conv2d_7/pointwise_kernel", "dtype": "float32"}]}, {"paths": ["group29-shard1of1"], "weights": [{"shape": [3, 3, 128, 1], "name": "separable_conv2d_8/depthwise_kernel", "dtype": "float32"}, {"shape": [1, 1, 128, 128], "name": "separable_conv2d_8/pointwise_kernel", "dtype": "float32"}]}], "modelTopology": {"backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 64, 64, 1], "name": "input_1", "dtype": "float32", "sparse": false}, "name": "input_1"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "padding": "valid", "strides": [1, 1], "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "conv2d_1", "activity_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 8, "bias_constraint": null, "use_bias": false}, "name": "conv2d_1"}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"momentum": 0.99, "trainable": true, "epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "name": "batch_normalization_1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null}, "name": "batch_normalization_1"}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "name": "activation_1"}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "padding": "valid", "strides": [1, 1], "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "conv2d_2", "activity_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 8, "bias_constraint": null, "use_bias": false}, "name": "conv2d_2"}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"momentum": 0.99, "trainable": true, "epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "name": "batch_normalization_2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null}, "name": "batch_normalization_2"}, {"inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "name": "activation_2"}, {"inbound_nodes": [[["activation_2", 0, 0, {}]]], "class_name": "SeparableConv2D", "config": {"activation": "linear", "pointwise_regularizer": null, "depth_multiplier": 1, "dilation_rate": [1, 1], "kernel_size": [3, 3], "depthwise_regularizer": null, "padding": "same", "strides": [1, 1], "trainable": true, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "separable_conv2d_1", "activity_regularizer": null, "pointwise_constraint": null, "bias_regularizer": null, "filters": 16, "depthwise_constraint": null, "use_bias": false}, "name": "separable_conv2d_1"}, {"inbound_nodes": [[["separable_conv2d_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"momentum": 0.99, "trainable": true, "epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "name": "batch_normalization_4", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null}, "name": "batch_normalization_4"}, {"inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "name": "activation_3"}, {"inbound_nodes": [[["activation_3", 0, 0, {}]]], "class_name": "SeparableConv2D", "config": {"activation": "linear", "pointwise_regularizer": null, "depth_multiplier": 1, "dilation_rate": [1, 1], "kernel_size": [3, 3], "depthwise_regularizer": null, "padding": "same", "strides": [1, 1], "trainable": true, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "separable_conv2d_2", "activity_regularizer": null, "pointwise_constraint": null, "bias_regularizer": null, "filters": 16, "depthwise_constraint": null, "use_bias": false}, "name": "separable_conv2d_2"}, {"inbound_nodes": [[["separable_conv2d_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"momentum": 0.99, "trainable": true, "epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "name": "batch_normalization_5", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null}, "name": "batch_normalization_5"}, {"inbound_nodes": [[["activation_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "padding": "same", "strides": [2, 2], "kernel_size": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "conv2d_3", "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 16, "bias_constraint": null, "use_bias": false}, "name": "conv2d_3"}, {"inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "name": "max_pooling2d_1", "padding": "same", "strides": [2, 2], "pool_size": [3, 3]}, "name": "max_pooling2d_1"}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"momentum": 0.99, "trainable": true, "epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "name": "batch_normalization_3", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null}, "name": "batch_normalization_3"}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}], ["batch_normalization_3", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_1"}, "name": "add_1"}, {"inbound_nodes": [[["add_1", 0, 0, {}]]], "class_name": "SeparableConv2D", "config": {"activation": "linear", "pointwise_regularizer": null, "depth_multiplier": 1, "dilation_rate": [1, 1], "kernel_size": [3, 3], "depthwise_regularizer": null, "padding": "same", "strides": [1, 1], "trainable": true, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "separable_conv2d_3", "activity_regularizer": null, "pointwise_constraint": null, "bias_regularizer": null, "filters": 32, "depthwise_constraint": null, "use_bias": false}, "name": "separable_conv2d_3"}, {"inbound_nodes": [[["separable_conv2d_3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"momentum": 0.99, "trainable": true, "epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "name": "batch_normalization_7", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null}, "name": "batch_normalization_7"}, {"inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "name": "activation_4"}, {"inbound_nodes": [[["activation_4", 0, 0, {}]]], "class_name": "SeparableConv2D", "config": {"activation": "linear", "pointwise_regularizer": null, "depth_multiplier": 1, "dilation_rate": [1, 1], "kernel_size": [3, 3], "depthwise_regularizer": null, "padding": "same", "strides": [1, 1], "trainable": true, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "separable_conv2d_4", "activity_regularizer": null, "pointwise_constraint": null, "bias_regularizer": null, "filters": 32, "depthwise_constraint": null, "use_bias": false}, "name": "separable_conv2d_4"}, {"inbound_nodes": [[["separable_conv2d_4", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"momentum": 0.99, "trainable": true, "epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "name": "batch_normalization_8", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null}, "name": "batch_normalization_8"}, {"inbound_nodes": [[["add_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "padding": "same", "strides": [2, 2], "kernel_size": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "conv2d_4", "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 32, "bias_constraint": null, "use_bias": false}, "name": "conv2d_4"}, {"inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "name": "max_pooling2d_2", "padding": "same", "strides": [2, 2], "pool_size": [3, 3]}, "name": "max_pooling2d_2"}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"momentum": 0.99, "trainable": true, "epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "name": "batch_normalization_6", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null}, "name": "batch_normalization_6"}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}], ["batch_normalization_6", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_2"}, "name": "add_2"}, {"inbound_nodes": [[["add_2", 0, 0, {}]]], "class_name": "SeparableConv2D", "config": {"activation": "linear", "pointwise_regularizer": null, "depth_multiplier": 1, "dilation_rate": [1, 1], "kernel_size": [3, 3], "depthwise_regularizer": null, "padding": "same", "strides": [1, 1], "trainable": true, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "separable_conv2d_5", "activity_regularizer": null, "pointwise_constraint": null, "bias_regularizer": null, "filters": 64, "depthwise_constraint": null, "use_bias": false}, "name": "separable_conv2d_5"}, {"inbound_nodes": [[["separable_conv2d_5", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"momentum": 0.99, "trainable": true, "epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "name": "batch_normalization_10", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null}, "name": "batch_normalization_10"}, {"inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}, "name": "activation_5"}, {"inbound_nodes": [[["activation_5", 0, 0, {}]]], "class_name": "SeparableConv2D", "config": {"activation": "linear", "pointwise_regularizer": null, "depth_multiplier": 1, "dilation_rate": [1, 1], "kernel_size": [3, 3], "depthwise_regularizer": null, "padding": "same", "strides": [1, 1], "trainable": true, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "separable_conv2d_6", "activity_regularizer": null, "pointwise_constraint": null, "bias_regularizer": null, "filters": 64, "depthwise_constraint": null, "use_bias": false}, "name": "separable_conv2d_6"}, {"inbound_nodes": [[["separable_conv2d_6", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"momentum": 0.99, "trainable": true, "epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "name": "batch_normalization_11", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null}, "name": "batch_normalization_11"}, {"inbound_nodes": [[["add_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "padding": "same", "strides": [2, 2], "kernel_size": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "conv2d_5", "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 64, "bias_constraint": null, "use_bias": false}, "name": "conv2d_5"}, {"inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "name": "max_pooling2d_3", "padding": "same", "strides": [2, 2], "pool_size": [3, 3]}, "name": "max_pooling2d_3"}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"momentum": 0.99, "trainable": true, "epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "name": "batch_normalization_9", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null}, "name": "batch_normalization_9"}, {"inbound_nodes": [[["max_pooling2d_3", 0, 0, {}], ["batch_normalization_9", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_3"}, "name": "add_3"}, {"inbound_nodes": [[["add_3", 0, 0, {}]]], "class_name": "SeparableConv2D", "config": {"activation": "linear", "pointwise_regularizer": null, "depth_multiplier": 1, "dilation_rate": [1, 1], "kernel_size": [3, 3], "depthwise_regularizer": null, "padding": "same", "strides": [1, 1], "trainable": true, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "separable_conv2d_7", "activity_regularizer": null, "pointwise_constraint": null, "bias_regularizer": null, "filters": 128, "depthwise_constraint": null, "use_bias": false}, "name": "separable_conv2d_7"}, {"inbound_nodes": [[["separable_conv2d_7", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"momentum": 0.99, "trainable": true, "epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "name": "batch_normalization_13", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null}, "name": "batch_normalization_13"}, {"inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}, "name": "activation_6"}, {"inbound_nodes": [[["activation_6", 0, 0, {}]]], "class_name": "SeparableConv2D", "config": {"activation": "linear", "pointwise_regularizer": null, "depth_multiplier": 1, "dilation_rate": [1, 1], "kernel_size": [3, 3], "depthwise_regularizer": null, "padding": "same", "strides": [1, 1], "trainable": true, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "separable_conv2d_8", "activity_regularizer": null, "pointwise_constraint": null, "bias_regularizer": null, "filters": 128, "depthwise_constraint": null, "use_bias": false}, "name": "separable_conv2d_8"}, {"inbound_nodes": [[["separable_conv2d_8", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"momentum": 0.99, "trainable": true, "epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "name": "batch_normalization_14", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null}, "name": "batch_normalization_14"}, {"inbound_nodes": [[["add_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "padding": "same", "strides": [2, 2], "kernel_size": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "conv2d_6", "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 128, "bias_constraint": null, "use_bias": false}, "name": "conv2d_6"}, {"inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "name": "max_pooling2d_4", "padding": "same", "strides": [2, 2], "pool_size": [3, 3]}, "name": "max_pooling2d_4"}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"momentum": 0.99, "trainable": true, "epsilon": 0.001, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "name": "batch_normalization_12", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null}, "name": "batch_normalization_12"}, {"inbound_nodes": [[["max_pooling2d_4", 0, 0, {}], ["batch_normalization_12", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_4"}, "name": "add_4"}, {"inbound_nodes": [[["add_4", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "padding": "same", "strides": [1, 1], "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "conv2d_7", "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 7, "bias_constraint": null, "use_bias": true}, "name": "conv2d_7"}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "GlobalAveragePooling2D", "config": {"trainable": true, "data_format": "channels_last", "name": "global_average_pooling2d_1"}, "name": "global_average_pooling2d_1"}, {"inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "predictions", "activation": "softmax"}, "name": "predictions"}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["predictions", 0, 0]]}}, "keras_version": "2.1.5"}}