{"weightsManifest": [{"weights": [{"name": "batch_normalization_1/gamma", "dtype": "float32", "shape": [8]}, {"name": "batch_normalization_1/beta", "dtype": "float32", "shape": [8]}, {"name": "batch_normalization_1/moving_mean", "dtype": "float32", "shape": [8]}, {"name": "batch_normalization_1/moving_variance", "dtype": "float32", "shape": [8]}], "paths": ["group1-shard1of1"]}, {"weights": [{"name": "batch_normalization_10/gamma", "dtype": "float32", "shape": [64]}, {"name": "batch_normalization_10/beta", "dtype": "float32", "shape": [64]}, {"name": "batch_normalization_10/moving_mean", "dtype": "float32", "shape": [64]}, {"name": "batch_normalization_10/moving_variance", "dtype": "float32", "shape": [64]}], "paths": ["group2-shard1of1"]}, {"weights": [{"name": "batch_normalization_11/gamma", "dtype": "float32", "shape": [64]}, {"name": "batch_normalization_11/beta", "dtype": "float32", "shape": [64]}, {"name": "batch_normalization_11/moving_mean", "dtype": "float32", "shape": [64]}, {"name": "batch_normalization_11/moving_variance", "dtype": "float32", "shape": [64]}], "paths": ["group3-shard1of1"]}, {"weights": [{"name": "batch_normalization_12/gamma", "dtype": "float32", "shape": [128]}, {"name": "batch_normalization_12/beta", "dtype": "float32", "shape": [128]}, {"name": "batch_normalization_12/moving_mean", "dtype": "float32", "shape": [128]}, {"name": "batch_normalization_12/moving_variance", "dtype": "float32", "shape": [128]}], "paths": ["group4-shard1of1"]}, {"weights": [{"name": "batch_normalization_13/gamma", "dtype": "float32", "shape": [128]}, {"name": "batch_normalization_13/beta", "dtype": "float32", "shape": [128]}, {"name": "batch_normalization_13/moving_mean", "dtype": "float32", "shape": [128]}, {"name": "batch_normalization_13/moving_variance", "dtype": "float32", "shape": [128]}], "paths": ["group5-shard1of1"]}, {"weights": [{"name": "batch_normalization_14/gamma", "dtype": "float32", "shape": [128]}, {"name": "batch_normalization_14/beta", "dtype": "float32", "shape": [128]}, {"name": "batch_normalization_14/moving_mean", "dtype": "float32", "shape": [128]}, {"name": "batch_normalization_14/moving_variance", "dtype": "float32", "shape": [128]}], "paths": ["group6-shard1of1"]}, {"weights": [{"name": "batch_normalization_2/gamma", "dtype": "float32", "shape": [8]}, {"name": "batch_normalization_2/beta", "dtype": "float32", "shape": [8]}, {"name": "batch_normalization_2/moving_mean", "dtype": "float32", "shape": [8]}, {"name": "batch_normalization_2/moving_variance", "dtype": "float32", "shape": [8]}], "paths": ["group7-shard1of1"]}, {"weights": [{"name": "batch_normalization_3/gamma", "dtype": "float32", "shape": [16]}, {"name": "batch_normalization_3/beta", "dtype": "float32", "shape": [16]}, {"name": "batch_normalization_3/moving_mean", "dtype": "float32", "shape": [16]}, {"name": "batch_normalization_3/moving_variance", "dtype": "float32", "shape": [16]}], "paths": ["group8-shard1of1"]}, {"weights": [{"name": "batch_normalization_4/gamma", "dtype": "float32", "shape": [16]}, {"name": "batch_normalization_4/beta", "dtype": "float32", "shape": [16]}, {"name": "batch_normalization_4/moving_mean", "dtype": "float32", "shape": [16]}, {"name": "batch_normalization_4/moving_variance", "dtype": "float32", "shape": [16]}], "paths": ["group9-shard1of1"]}, {"weights": [{"name": "batch_normalization_5/gamma", "dtype": "float32", "shape": [16]}, {"name": "batch_normalization_5/beta", "dtype": "float32", "shape": [16]}, {"name": "batch_normalization_5/moving_mean", "dtype": "float32", "shape": [16]}, {"name": "batch_normalization_5/moving_variance", "dtype": "float32", "shape": [16]}], "paths": ["group10-shard1of1"]}, {"weights": [{"name": "batch_normalization_6/gamma", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_6/beta", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_6/moving_mean", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_6/moving_variance", "dtype": "float32", "shape": [32]}], "paths": ["group11-shard1of1"]}, {"weights": [{"name": "batch_normalization_7/gamma", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_7/beta", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_7/moving_mean", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_7/moving_variance", "dtype": "float32", "shape": [32]}], "paths": ["group12-shard1of1"]}, {"weights": [{"name": "batch_normalization_8/gamma", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_8/beta", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_8/moving_mean", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_8/moving_variance", "dtype": "float32", "shape": [32]}], "paths": ["group13-shard1of1"]}, {"weights": [{"name": "batch_normalization_9/gamma", "dtype": "float32", "shape": [64]}, {"name": "batch_normalization_9/beta", "dtype": "float32", "shape": [64]}, {"name": "batch_normalization_9/moving_mean", "dtype": "float32", "shape": [64]}, {"name": "batch_normalization_9/moving_variance", "dtype": "float32", "shape": [64]}], "paths": ["group14-shard1of1"]}, {"weights": [{"name": "conv2d_1/kernel", "dtype": "float32", "shape": [3, 3, 1, 8]}], "paths": ["group15-shard1of1"]}, {"weights": [{"name": "conv2d_2/kernel", "dtype": "float32", "shape": [3, 3, 8, 8]}], "paths": ["group16-shard1of1"]}, {"weights": [{"name": "conv2d_3/kernel", "dtype": "float32", "shape": [1, 1, 8, 16]}], "paths": ["group17-shard1of1"]}, {"weights": [{"name": "conv2d_4/kernel", "dtype": "float32", "shape": [1, 1, 16, 32]}], "paths": ["group18-shard1of1"]}, {"weights": [{"name": "conv2d_5/kernel", "dtype": "float32", "shape": [1, 1, 32, 64]}], "paths": ["group19-shard1of1"]}, {"weights": [{"name": "conv2d_6/kernel", "dtype": "float32", "shape": [1, 1, 64, 128]}], "paths": ["group20-shard1of1"]}, {"weights": [{"name": "conv2d_7/kernel", "dtype": "float32", "shape": [3, 3, 128, 7]}, {"name": "conv2d_7/bias", "dtype": "float32", "shape": [7]}], "paths": ["group21-shard1of1"]}, {"weights": [{"name": "separable_conv2d_1/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 8, 1]}, {"name": "separable_conv2d_1/pointwise_kernel", "dtype": "float32", "shape": [1, 1, 8, 16]}], "paths": ["group22-shard1of1"]}, {"weights": [{"name": "separable_conv2d_2/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 16, 1]}, {"name": "separable_conv2d_2/pointwise_kernel", "dtype": "float32", "shape": [1, 1, 16, 16]}], "paths": ["group23-shard1of1"]}, {"weights": [{"name": "separable_conv2d_3/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 16, 1]}, {"name": "separable_conv2d_3/pointwise_kernel", "dtype": "float32", "shape": [1, 1, 16, 32]}], "paths": ["group24-shard1of1"]}, {"weights": [{"name": "separable_conv2d_4/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 32, 1]}, {"name": "separable_conv2d_4/pointwise_kernel", "dtype": "float32", "shape": [1, 1, 32, 32]}], "paths": ["group25-shard1of1"]}, {"weights": [{"name": "separable_conv2d_5/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 32, 1]}, {"name": "separable_conv2d_5/pointwise_kernel", "dtype": "float32", "shape": [1, 1, 32, 64]}], "paths": ["group26-shard1of1"]}, {"weights": [{"name": "separable_conv2d_6/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 64, 1]}, {"name": "separable_conv2d_6/pointwise_kernel", "dtype": "float32", "shape": [1, 1, 64, 64]}], "paths": ["group27-shard1of1"]}, {"weights": [{"name": "separable_conv2d_7/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 64, 1]}, {"name": "separable_conv2d_7/pointwise_kernel", "dtype": "float32", "shape": [1, 1, 64, 128]}], "paths": ["group28-shard1of1"]}, {"weights": [{"name": "separable_conv2d_8/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 128, 1]}, {"name": "separable_conv2d_8/pointwise_kernel", "dtype": "float32", "shape": [1, 1, 128, 128]}], "paths": ["group29-shard1of1"]}], "modelTopology": {"backend": "tensorflow", "keras_version": "2.1.5", "model_config": {"class_name": "Model", "config": {"name": "model_1", "output_layers": [["predictions", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"name": "input_1", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 64, 64, 1]}, "inbound_nodes": []}, {"name": "conv2d_1", "class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "filters": 8, "kernel_constraint": null, "use_bias": false, "kernel_size": [3, 3], "name": "conv2d_1", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "dilation_rate": [1, 1], "padding": "valid", "bias_constraint": null, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_1", "center": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "conv2d_2", "class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "filters": 8, "kernel_constraint": null, "use_bias": false, "kernel_size": [3, 3], "name": "conv2d_2", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "dilation_rate": [1, 1], "padding": "valid", "bias_constraint": null, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_2", "center": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "activation_2", "class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"name": "separable_conv2d_1", "class_name": "SeparableConv2D", "config": {"pointwise_regularizer": null, "depthwise_constraint": null, "activity_regularizer": null, "filters": 16, "use_bias": false, "kernel_size": [3, 3], "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "separable_conv2d_1", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "data_format": "channels_last", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "depthwise_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "strides": [1, 1], "padding": "same", "trainable": true}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_4", "center": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "inbound_nodes": [[["separable_conv2d_1", 0, 0, {}]]]}, {"name": "activation_3", "class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"name": "separable_conv2d_2", "class_name": "SeparableConv2D", "config": {"pointwise_regularizer": null, "depthwise_constraint": null, "activity_regularizer": null, "filters": 16, "use_bias": false, "kernel_size": [3, 3], "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "separable_conv2d_2", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "data_format": "channels_last", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "depthwise_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "strides": [1, 1], "padding": "same", "trainable": true}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "batch_normalization_5", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_5", "center": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "inbound_nodes": [[["separable_conv2d_2", 0, 0, {}]]]}, {"name": "conv2d_3", "class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "filters": 16, "kernel_constraint": null, "use_bias": false, "kernel_size": [1, 1], "name": "conv2d_3", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "trainable": true, "kernel_regularizer": null}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "data_format": "channels_last", "pool_size": [3, 3], "strides": [2, 2], "padding": "same", "trainable": true}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_3", "center": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "add_1", "class_name": "Add", "config": {"name": "add_1", "trainable": true}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}], ["batch_normalization_3", 0, 0, {}]]]}, {"name": "separable_conv2d_3", "class_name": "SeparableConv2D", "config": {"pointwise_regularizer": null, "depthwise_constraint": null, "activity_regularizer": null, "filters": 32, "use_bias": false, "kernel_size": [3, 3], "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "separable_conv2d_3", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "data_format": "channels_last", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "depthwise_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "strides": [1, 1], "padding": "same", "trainable": true}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"name": "batch_normalization_7", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_7", "center": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "inbound_nodes": [[["separable_conv2d_3", 0, 0, {}]]]}, {"name": "activation_4", "class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"name": "separable_conv2d_4", "class_name": "SeparableConv2D", "config": {"pointwise_regularizer": null, "depthwise_constraint": null, "activity_regularizer": null, "filters": 32, "use_bias": false, "kernel_size": [3, 3], "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "separable_conv2d_4", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "data_format": "channels_last", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "depthwise_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "strides": [1, 1], "padding": "same", "trainable": true}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"name": "batch_normalization_8", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_8", "center": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "inbound_nodes": [[["separable_conv2d_4", 0, 0, {}]]]}, {"name": "conv2d_4", "class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "filters": 32, "kernel_constraint": null, "use_bias": false, "kernel_size": [1, 1], "name": "conv2d_4", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "trainable": true, "kernel_regularizer": null}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"name": "max_pooling2d_2", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "data_format": "channels_last", "pool_size": [3, 3], "strides": [2, 2], "padding": "same", "trainable": true}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"name": "batch_normalization_6", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_6", "center": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"name": "add_2", "class_name": "Add", "config": {"name": "add_2", "trainable": true}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}], ["batch_normalization_6", 0, 0, {}]]]}, {"name": "separable_conv2d_5", "class_name": "SeparableConv2D", "config": {"pointwise_regularizer": null, "depthwise_constraint": null, "activity_regularizer": null, "filters": 64, "use_bias": false, "kernel_size": [3, 3], "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "separable_conv2d_5", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "data_format": "channels_last", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "depthwise_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "strides": [1, 1], "padding": "same", "trainable": true}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"name": "batch_normalization_10", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_10", "center": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "inbound_nodes": [[["separable_conv2d_5", 0, 0, {}]]]}, {"name": "activation_5", "class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"name": "separable_conv2d_6", "class_name": "SeparableConv2D", "config": {"pointwise_regularizer": null, "depthwise_constraint": null, "activity_regularizer": null, "filters": 64, "use_bias": false, "kernel_size": [3, 3], "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "separable_conv2d_6", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "data_format": "channels_last", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "depthwise_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "strides": [1, 1], "padding": "same", "trainable": true}, "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"name": "batch_normalization_11", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_11", "center": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "inbound_nodes": [[["separable_conv2d_6", 0, 0, {}]]]}, {"name": "conv2d_5", "class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "filters": 64, "kernel_constraint": null, "use_bias": false, "kernel_size": [1, 1], "name": "conv2d_5", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "trainable": true, "kernel_regularizer": null}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"name": "max_pooling2d_3", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "data_format": "channels_last", "pool_size": [3, 3], "strides": [2, 2], "padding": "same", "trainable": true}, "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"name": "batch_normalization_9", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_9", "center": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"name": "add_3", "class_name": "Add", "config": {"name": "add_3", "trainable": true}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}], ["batch_normalization_9", 0, 0, {}]]]}, {"name": "separable_conv2d_7", "class_name": "SeparableConv2D", "config": {"pointwise_regularizer": null, "depthwise_constraint": null, "activity_regularizer": null, "filters": 128, "use_bias": false, "kernel_size": [3, 3], "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "separable_conv2d_7", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "data_format": "channels_last", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "depthwise_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "strides": [1, 1], "padding": "same", "trainable": true}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"name": "batch_normalization_13", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_13", "center": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "inbound_nodes": [[["separable_conv2d_7", 0, 0, {}]]]}, {"name": "activation_6", "class_name": "Activation", "config": {"name": "activation_6", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"name": "separable_conv2d_8", "class_name": "SeparableConv2D", "config": {"pointwise_regularizer": null, "depthwise_constraint": null, "activity_regularizer": null, "filters": 128, "use_bias": false, "kernel_size": [3, 3], "pointwise_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "separable_conv2d_8", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "data_format": "channels_last", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "depthwise_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "strides": [1, 1], "padding": "same", "trainable": true}, "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"name": "batch_normalization_14", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_14", "center": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "inbound_nodes": [[["separable_conv2d_8", 0, 0, {}]]]}, {"name": "conv2d_6", "class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "filters": 128, "kernel_constraint": null, "use_bias": false, "kernel_size": [1, 1], "name": "conv2d_6", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "trainable": true, "kernel_regularizer": null}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"name": "max_pooling2d_4", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_4", "data_format": "channels_last", "pool_size": [3, 3], "strides": [2, 2], "padding": "same", "trainable": true}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"name": "batch_normalization_12", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_12", "center": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"name": "add_4", "class_name": "Add", "config": {"name": "add_4", "trainable": true}, "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}], ["batch_normalization_12", 0, 0, {}]]]}, {"name": "conv2d_7", "class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "filters": 7, "kernel_constraint": null, "use_bias": true, "kernel_size": [3, 3], "name": "conv2d_7", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "trainable": true, "kernel_regularizer": null}, "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"name": "global_average_pooling2d_1", "class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_1", "data_format": "channels_last", "trainable": true}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"name": "predictions", "class_name": "Activation", "config": {"name": "predictions", "activation": "softmax", "trainable": true}, "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]]}}}}