{"weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "conv2d_1/kernel", "dtype": "float32", "shape": [3, 3, 3, 32]}, {"name": "conv2d_1/bias", "dtype": "float32", "shape": [32]}]}, {"paths": ["group2-shard1of1"], "weights": [{"name": "conv2d_2/kernel", "dtype": "float32", "shape": [3, 3, 32, 64]}, {"name": "conv2d_2/bias", "dtype": "float32", "shape": [64]}]}, {"paths": ["group3-shard1of1"], "weights": [{"name": "conv2d_3/kernel", "dtype": "float32", "shape": [3, 3, 64, 128]}, {"name": "conv2d_3/bias", "dtype": "float32", "shape": [128]}]}, {"paths": ["group4-shard1of1"], "weights": [{"name": "conv2d_4/kernel", "dtype": "float32", "shape": [3, 3, 128, 128]}, {"name": "conv2d_4/bias", "dtype": "float32", "shape": [128]}]}, {"paths": ["group5-shard1of2", "group5-shard2of2"], "weights": [{"name": "dense_1/kernel", "dtype": "float32", "shape": [2048, 512]}, {"name": "dense_1/bias", "dtype": "float32", "shape": [512]}]}, {"paths": ["group6-shard1of1"], "weights": [{"name": "dense_2/kernel", "dtype": "float32", "shape": [512, 10]}, {"name": "dense_2/bias", "dtype": "float32", "shape": [10]}]}], "modelTopology": {"keras_version": "2.1.5", "model_config": {"config": [{"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dtype": "float32", "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 32, "strides": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_1", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "padding": "valid", "trainable": true, "batch_input_shape": [null, 100, 100, 3], "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "strides": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "filters": 64, "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_2", "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "padding": "valid", "trainable": true, "data_format": "channels_last", "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "strides": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "filters": 128, "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_3", "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "padding": "valid", "trainable": true, "data_format": "channels_last", "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_3", "strides": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "filters": 128, "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_4", "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "padding": "valid", "trainable": true, "data_format": "channels_last", "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_4", "strides": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_1", "noise_shape": null, "trainable": true, "rate": 0.5, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 512, "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 10, "kernel_regularizer": null, "activation": "softmax", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}, "training_config": {"loss": "categorical_crossentropy", "loss_weights": null, "metrics": ["acc"], "optimizer_config": {"config": {"epsilon": 1e-07, "amsgrad": false, "beta_2": 0.9990000128746033, "beta_1": 0.8999999761581421, "lr": 0.0010000000474974513, "decay": 0.0}, "class_name": "Adam"}, "sample_weight_mode": null}, "backend": "tensorflow"}}