{"modelTopology": {"keras_version": "2.1.5", "backend": "tensorflow", "model_config": {"config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["predictions", 0, 0]], "name": "model_1", "layers": [{"inbound_nodes": [], "name": "input_1", "config": {"dtype": "float32", "name": "input_1", "batch_input_shape": [null, 64, 64, 1], "sparse": false}, "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1", "config": {"activity_regularizer": null, "name": "conv2d_1", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "use_bias": false, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "filters": 8, "bias_constraint": null, "padding": "valid", "trainable": true, "strides": [1, 1], "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "batch_normalization_1", "config": {"scale": true, "name": "batch_normalization_1", "center": true, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "activation_1", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "conv2d_2", "config": {"activity_regularizer": null, "name": "conv2d_2", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "use_bias": false, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "filters": 8, "bias_constraint": null, "padding": "valid", "trainable": true, "strides": [1, 1], "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "batch_normalization_2", "config": {"scale": true, "name": "batch_normalization_2", "center": true, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "name": "activation_2", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "separable_conv2d_1", "config": {"pointwise_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "separable_conv2d_1", "trainable": true, "pointwise_constraint": null, "depth_multiplier": 1, "activation": "linear", "depthwise_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 16, "bias_constraint": null, "activity_regularizer": null, "use_bias": false, "pointwise_regularizer": null, "depthwise_constraint": null, "padding": "same", "depthwise_regularizer": null}, "class_name": "SeparableConv2D"}, {"inbound_nodes": [[["separable_conv2d_1", 0, 0, {}]]], "name": "batch_normalization_4", "config": {"scale": true, "name": "batch_normalization_4", "center": true, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "name": "activation_3", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "separable_conv2d_2", "config": {"pointwise_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "separable_conv2d_2", "trainable": true, "pointwise_constraint": null, "depth_multiplier": 1, "activation": "linear", "depthwise_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 16, "bias_constraint": null, "activity_regularizer": null, "use_bias": false, "pointwise_regularizer": null, "depthwise_constraint": null, "padding": "same", "depthwise_regularizer": null}, "class_name": "SeparableConv2D"}, {"inbound_nodes": [[["separable_conv2d_2", 0, 0, {}]]], "name": "batch_normalization_5", "config": {"scale": true, "name": "batch_normalization_5", "center": true, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "conv2d_3", "config": {"activity_regularizer": null, "name": "conv2d_3", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "use_bias": false, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "filters": 16, "bias_constraint": null, "padding": "same", "trainable": true, "strides": [2, 2], "kernel_size": [1, 1]}, "class_name": "Conv2D"}, {"inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "name": "max_pooling2d_1", "config": {"name": "max_pooling2d_1", "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "batch_normalization_3", "config": {"scale": true, "name": "batch_normalization_3", "center": true, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}], ["batch_normalization_3", 0, 0, {}]]], "name": "add_1", "config": {"name": "add_1", "trainable": true}, "class_name": "Add"}, {"inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "separable_conv2d_3", "config": {"pointwise_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "separable_conv2d_3", "trainable": true, "pointwise_constraint": null, "depth_multiplier": 1, "activation": "linear", "depthwise_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "bias_constraint": null, "activity_regularizer": null, "use_bias": false, "pointwise_regularizer": null, "depthwise_constraint": null, "padding": "same", "depthwise_regularizer": null}, "class_name": "SeparableConv2D"}, {"inbound_nodes": [[["separable_conv2d_3", 0, 0, {}]]], "name": "batch_normalization_7", "config": {"scale": true, "name": "batch_normalization_7", "center": true, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "name": "activation_4", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "separable_conv2d_4", "config": {"pointwise_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "separable_conv2d_4", "trainable": true, "pointwise_constraint": null, "depth_multiplier": 1, "activation": "linear", "depthwise_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "bias_constraint": null, "activity_regularizer": null, "use_bias": false, "pointwise_regularizer": null, "depthwise_constraint": null, "padding": "same", "depthwise_regularizer": null}, "class_name": "SeparableConv2D"}, {"inbound_nodes": [[["separable_conv2d_4", 0, 0, {}]]], "name": "batch_normalization_8", "config": {"scale": true, "name": "batch_normalization_8", "center": true, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "conv2d_4", "config": {"activity_regularizer": null, "name": "conv2d_4", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "use_bias": false, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "filters": 32, "bias_constraint": null, "padding": "same", "trainable": true, "strides": [2, 2], "kernel_size": [1, 1]}, "class_name": "Conv2D"}, {"inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "name": "max_pooling2d_2", "config": {"name": "max_pooling2d_2", "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "batch_normalization_6", "config": {"scale": true, "name": "batch_normalization_6", "center": true, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}], ["batch_normalization_6", 0, 0, {}]]], "name": "add_2", "config": {"name": "add_2", "trainable": true}, "class_name": "Add"}, {"inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "separable_conv2d_5", "config": {"pointwise_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "separable_conv2d_5", "trainable": true, "pointwise_constraint": null, "depth_multiplier": 1, "activation": "linear", "depthwise_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "bias_constraint": null, "activity_regularizer": null, "use_bias": false, "pointwise_regularizer": null, "depthwise_constraint": null, "padding": "same", "depthwise_regularizer": null}, "class_name": "SeparableConv2D"}, {"inbound_nodes": [[["separable_conv2d_5", 0, 0, {}]]], "name": "batch_normalization_10", "config": {"scale": true, "name": "batch_normalization_10", "center": true, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "name": "activation_5", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_5", 0, 0, {}]]], "name": "separable_conv2d_6", "config": {"pointwise_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "separable_conv2d_6", "trainable": true, "pointwise_constraint": null, "depth_multiplier": 1, "activation": "linear", "depthwise_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "bias_constraint": null, "activity_regularizer": null, "use_bias": false, "pointwise_regularizer": null, "depthwise_constraint": null, "padding": "same", "depthwise_regularizer": null}, "class_name": "SeparableConv2D"}, {"inbound_nodes": [[["separable_conv2d_6", 0, 0, {}]]], "name": "batch_normalization_11", "config": {"scale": true, "name": "batch_normalization_11", "center": true, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "conv2d_5", "config": {"activity_regularizer": null, "name": "conv2d_5", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "use_bias": false, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "filters": 64, "bias_constraint": null, "padding": "same", "trainable": true, "strides": [2, 2], "kernel_size": [1, 1]}, "class_name": "Conv2D"}, {"inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "name": "max_pooling2d_3", "config": {"name": "max_pooling2d_3", "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "batch_normalization_9", "config": {"scale": true, "name": "batch_normalization_9", "center": true, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["max_pooling2d_3", 0, 0, {}], ["batch_normalization_9", 0, 0, {}]]], "name": "add_3", "config": {"name": "add_3", "trainable": true}, "class_name": "Add"}, {"inbound_nodes": [[["add_3", 0, 0, {}]]], "name": "separable_conv2d_7", "config": {"pointwise_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "separable_conv2d_7", "trainable": true, "pointwise_constraint": null, "depth_multiplier": 1, "activation": "linear", "depthwise_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 128, "bias_constraint": null, "activity_regularizer": null, "use_bias": false, "pointwise_regularizer": null, "depthwise_constraint": null, "padding": "same", "depthwise_regularizer": null}, "class_name": "SeparableConv2D"}, {"inbound_nodes": [[["separable_conv2d_7", 0, 0, {}]]], "name": "batch_normalization_13", "config": {"scale": true, "name": "batch_normalization_13", "center": true, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "name": "activation_6", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_6", 0, 0, {}]]], "name": "separable_conv2d_8", "config": {"pointwise_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "separable_conv2d_8", "trainable": true, "pointwise_constraint": null, "depth_multiplier": 1, "activation": "linear", "depthwise_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 128, "bias_constraint": null, "activity_regularizer": null, "use_bias": false, "pointwise_regularizer": null, "depthwise_constraint": null, "padding": "same", "depthwise_regularizer": null}, "class_name": "SeparableConv2D"}, {"inbound_nodes": [[["separable_conv2d_8", 0, 0, {}]]], "name": "batch_normalization_14", "config": {"scale": true, "name": "batch_normalization_14", "center": true, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["add_3", 0, 0, {}]]], "name": "conv2d_6", "config": {"activity_regularizer": null, "name": "conv2d_6", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "use_bias": false, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "filters": 128, "bias_constraint": null, "padding": "same", "trainable": true, "strides": [2, 2], "kernel_size": [1, 1]}, "class_name": "Conv2D"}, {"inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "name": "max_pooling2d_4", "config": {"name": "max_pooling2d_4", "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "batch_normalization_12", "config": {"scale": true, "name": "batch_normalization_12", "center": true, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["max_pooling2d_4", 0, 0, {}], ["batch_normalization_12", 0, 0, {}]]], "name": "add_4", "config": {"name": "add_4", "trainable": true}, "class_name": "Add"}, {"inbound_nodes": [[["add_4", 0, 0, {}]]], "name": "conv2d_7", "config": {"activity_regularizer": null, "name": "conv2d_7", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "use_bias": true, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "filters": 7, "bias_constraint": null, "padding": "same", "trainable": true, "strides": [1, 1], "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "global_average_pooling2d_1", "config": {"name": "global_average_pooling2d_1", "trainable": true, "data_format": "channels_last"}, "class_name": "GlobalAveragePooling2D"}, {"inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]], "name": "predictions", "config": {"name": "predictions", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}]}, "class_name": "Model"}}, "weightsManifest": [{"weights": [{"dtype": "float32", "shape": [8], "name": "batch_normalization_1/gamma"}, {"dtype": "float32", "shape": [8], "name": "batch_normalization_1/beta"}, {"dtype": "float32", "shape": [8], "name": "batch_normalization_1/moving_mean"}, {"dtype": "float32", "shape": [8], "name": "batch_normalization_1/moving_variance"}], "paths": ["group1-shard1of1"]}, {"weights": [{"dtype": "float32", "shape": [64], "name": "batch_normalization_10/gamma"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_10/beta"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_10/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_10/moving_variance"}], "paths": ["group2-shard1of1"]}, {"weights": [{"dtype": "float32", "shape": [64], "name": "batch_normalization_11/gamma"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_11/beta"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_11/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_11/moving_variance"}], "paths": ["group3-shard1of1"]}, {"weights": [{"dtype": "float32", "shape": [128], "name": "batch_normalization_12/gamma"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_12/beta"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_12/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_12/moving_variance"}], "paths": ["group4-shard1of1"]}, {"weights": [{"dtype": "float32", "shape": [128], "name": "batch_normalization_13/gamma"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_13/beta"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_13/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_13/moving_variance"}], "paths": ["group5-shard1of1"]}, {"weights": [{"dtype": "float32", "shape": [128], "name": "batch_normalization_14/gamma"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_14/beta"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_14/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_14/moving_variance"}], "paths": ["group6-shard1of1"]}, {"weights": [{"dtype": "float32", "shape": [8], "name": "batch_normalization_2/gamma"}, {"dtype": "float32", "shape": [8], "name": "batch_normalization_2/beta"}, {"dtype": "float32", "shape": [8], "name": "batch_normalization_2/moving_mean"}, {"dtype": "float32", "shape": [8], "name": "batch_normalization_2/moving_variance"}], "paths": ["group7-shard1of1"]}, {"weights": [{"dtype": "float32", "shape": [16], "name": "batch_normalization_3/gamma"}, {"dtype": "float32", "shape": [16], "name": "batch_normalization_3/beta"}, {"dtype": "float32", "shape": [16], "name": "batch_normalization_3/moving_mean"}, {"dtype": "float32", "shape": [16], "name": "batch_normalization_3/moving_variance"}], "paths": ["group8-shard1of1"]}, {"weights": [{"dtype": "float32", "shape": [16], "name": "batch_normalization_4/gamma"}, {"dtype": "float32", "shape": [16], "name": "batch_normalization_4/beta"}, {"dtype": "float32", "shape": [16], "name": "batch_normalization_4/moving_mean"}, {"dtype": "float32", "shape": [16], "name": "batch_normalization_4/moving_variance"}], "paths": ["group9-shard1of1"]}, {"weights": [{"dtype": "float32", "shape": [16], "name": "batch_normalization_5/gamma"}, {"dtype": "float32", "shape": [16], "name": "batch_normalization_5/beta"}, {"dtype": "float32", "shape": [16], "name": "batch_normalization_5/moving_mean"}, {"dtype": "float32", "shape": [16], "name": "batch_normalization_5/moving_variance"}], "paths": ["group10-shard1of1"]}, {"weights": [{"dtype": "float32", "shape": [32], "name": "batch_normalization_6/gamma"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_6/beta"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_6/moving_mean"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_6/moving_variance"}], "paths": ["group11-shard1of1"]}, {"weights": [{"dtype": "float32", "shape": [32], "name": "batch_normalization_7/gamma"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_7/beta"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_7/moving_mean"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_7/moving_variance"}], "paths": ["group12-shard1of1"]}, {"weights": [{"dtype": "float32", "shape": [32], "name": "batch_normalization_8/gamma"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_8/beta"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_8/moving_mean"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_8/moving_variance"}], "paths": ["group13-shard1of1"]}, {"weights": [{"dtype": "float32", "shape": [64], "name": "batch_normalization_9/gamma"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_9/beta"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_9/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_9/moving_variance"}], "paths": ["group14-shard1of1"]}, {"weights": [{"dtype": "float32", "shape": [3, 3, 1, 8], "name": "conv2d_1/kernel"}], "paths": ["group15-shard1of1"]}, {"weights": [{"dtype": "float32", "shape": [3, 3, 8, 8], "name": "conv2d_2/kernel"}], "paths": ["group16-shard1of1"]}, {"weights": [{"dtype": "float32", "shape": [1, 1, 8, 16], "name": "conv2d_3/kernel"}], "paths": ["group17-shard1of1"]}, {"weights": [{"dtype": "float32", "shape": [1, 1, 16, 32], "name": "conv2d_4/kernel"}], "paths": ["group18-shard1of1"]}, {"weights": [{"dtype": "float32", "shape": [1, 1, 32, 64], "name": "conv2d_5/kernel"}], "paths": ["group19-shard1of1"]}, {"weights": [{"dtype": "float32", "shape": [1, 1, 64, 128], "name": "conv2d_6/kernel"}], "paths": ["group20-shard1of1"]}, {"weights": [{"dtype": "float32", "shape": [3, 3, 128, 7], "name": "conv2d_7/kernel"}, {"dtype": "float32", "shape": [7], "name": "conv2d_7/bias"}], "paths": ["group21-shard1of1"]}, {"weights": [{"dtype": "float32", "shape": [3, 3, 8, 1], "name": "separable_conv2d_1/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 8, 16], "name": "separable_conv2d_1/pointwise_kernel"}], "paths": ["group22-shard1of1"]}, {"weights": [{"dtype": "float32", "shape": [3, 3, 16, 1], "name": "separable_conv2d_2/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 16, 16], "name": "separable_conv2d_2/pointwise_kernel"}], "paths": ["group23-shard1of1"]}, {"weights": [{"dtype": "float32", "shape": [3, 3, 16, 1], "name": "separable_conv2d_3/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 16, 32], "name": "separable_conv2d_3/pointwise_kernel"}], "paths": ["group24-shard1of1"]}, {"weights": [{"dtype": "float32", "shape": [3, 3, 32, 1], "name": "separable_conv2d_4/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 32, 32], "name": "separable_conv2d_4/pointwise_kernel"}], "paths": ["group25-shard1of1"]}, {"weights": [{"dtype": "float32", "shape": [3, 3, 32, 1], "name": "separable_conv2d_5/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 32, 64], "name": "separable_conv2d_5/pointwise_kernel"}], "paths": ["group26-shard1of1"]}, {"weights": [{"dtype": "float32", "shape": [3, 3, 64, 1], "name": "separable_conv2d_6/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 64, 64], "name": "separable_conv2d_6/pointwise_kernel"}], "paths": ["group27-shard1of1"]}, {"weights": [{"dtype": "float32", "shape": [3, 3, 64, 1], "name": "separable_conv2d_7/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 64, 128], "name": "separable_conv2d_7/pointwise_kernel"}], "paths": ["group28-shard1of1"]}, {"weights": [{"dtype": "float32", "shape": [3, 3, 128, 1], "name": "separable_conv2d_8/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 128, 128], "name": "separable_conv2d_8/pointwise_kernel"}], "paths": ["group29-shard1of1"]}]}