{"weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "batch_normalization_1/gamma", "dtype": "float32", "shape": [8]}, {"name": "batch_normalization_1/beta", "dtype": "float32", "shape": [8]}, {"name": "batch_normalization_1/moving_mean", "dtype": "float32", "shape": [8]}, {"name": "batch_normalization_1/moving_variance", "dtype": "float32", "shape": [8]}]}, {"paths": ["group2-shard1of1"], "weights": [{"name": "batch_normalization_10/gamma", "dtype": "float32", "shape": [64]}, {"name": "batch_normalization_10/beta", "dtype": "float32", "shape": [64]}, {"name": "batch_normalization_10/moving_mean", "dtype": "float32", "shape": [64]}, {"name": "batch_normalization_10/moving_variance", "dtype": "float32", "shape": [64]}]}, {"paths": ["group3-shard1of1"], "weights": [{"name": "batch_normalization_11/gamma", "dtype": "float32", "shape": [64]}, {"name": "batch_normalization_11/beta", "dtype": "float32", "shape": [64]}, {"name": "batch_normalization_11/moving_mean", "dtype": "float32", "shape": [64]}, {"name": "batch_normalization_11/moving_variance", "dtype": "float32", "shape": [64]}]}, {"paths": ["group4-shard1of1"], "weights": [{"name": "batch_normalization_12/gamma", "dtype": "float32", "shape": [128]}, {"name": "batch_normalization_12/beta", "dtype": "float32", "shape": [128]}, {"name": "batch_normalization_12/moving_mean", "dtype": "float32", "shape": [128]}, {"name": "batch_normalization_12/moving_variance", "dtype": "float32", "shape": [128]}]}, {"paths": ["group5-shard1of1"], "weights": [{"name": "batch_normalization_13/gamma", "dtype": "float32", "shape": [128]}, {"name": "batch_normalization_13/beta", "dtype": "float32", "shape": [128]}, {"name": "batch_normalization_13/moving_mean", "dtype": "float32", "shape": [128]}, {"name": "batch_normalization_13/moving_variance", "dtype": "float32", "shape": [128]}]}, {"paths": ["group6-shard1of1"], "weights": [{"name": "batch_normalization_14/gamma", "dtype": "float32", "shape": [128]}, {"name": "batch_normalization_14/beta", "dtype": "float32", "shape": [128]}, {"name": "batch_normalization_14/moving_mean", "dtype": "float32", "shape": [128]}, {"name": "batch_normalization_14/moving_variance", "dtype": "float32", "shape": [128]}]}, {"paths": ["group7-shard1of1"], "weights": [{"name": "batch_normalization_2/gamma", "dtype": "float32", "shape": [8]}, {"name": "batch_normalization_2/beta", "dtype": "float32", "shape": [8]}, {"name": "batch_normalization_2/moving_mean", "dtype": "float32", "shape": [8]}, {"name": "batch_normalization_2/moving_variance", "dtype": "float32", "shape": [8]}]}, {"paths": ["group8-shard1of1"], "weights": [{"name": "batch_normalization_3/gamma", "dtype": "float32", "shape": [16]}, {"name": "batch_normalization_3/beta", "dtype": "float32", "shape": [16]}, {"name": "batch_normalization_3/moving_mean", "dtype": "float32", "shape": [16]}, {"name": "batch_normalization_3/moving_variance", "dtype": "float32", "shape": [16]}]}, {"paths": ["group9-shard1of1"], "weights": [{"name": "batch_normalization_4/gamma", "dtype": "float32", "shape": [16]}, {"name": "batch_normalization_4/beta", "dtype": "float32", "shape": [16]}, {"name": "batch_normalization_4/moving_mean", "dtype": "float32", "shape": [16]}, {"name": "batch_normalization_4/moving_variance", "dtype": "float32", "shape": [16]}]}, {"paths": ["group10-shard1of1"], "weights": [{"name": "batch_normalization_5/gamma", "dtype": "float32", "shape": [16]}, {"name": "batch_normalization_5/beta", "dtype": "float32", "shape": [16]}, {"name": "batch_normalization_5/moving_mean", "dtype": "float32", "shape": [16]}, {"name": "batch_normalization_5/moving_variance", "dtype": "float32", "shape": [16]}]}, {"paths": ["group11-shard1of1"], "weights": [{"name": "batch_normalization_6/gamma", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_6/beta", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_6/moving_mean", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_6/moving_variance", "dtype": "float32", "shape": [32]}]}, {"paths": ["group12-shard1of1"], "weights": [{"name": "batch_normalization_7/gamma", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_7/beta", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_7/moving_mean", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_7/moving_variance", "dtype": "float32", "shape": [32]}]}, {"paths": ["group13-shard1of1"], "weights": [{"name": "batch_normalization_8/gamma", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_8/beta", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_8/moving_mean", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_8/moving_variance", "dtype": "float32", "shape": [32]}]}, {"paths": ["group14-shard1of1"], "weights": [{"name": "batch_normalization_9/gamma", "dtype": "float32", "shape": [64]}, {"name": "batch_normalization_9/beta", "dtype": "float32", "shape": [64]}, {"name": "batch_normalization_9/moving_mean", "dtype": "float32", "shape": [64]}, {"name": "batch_normalization_9/moving_variance", "dtype": "float32", "shape": [64]}]}, {"paths": ["group15-shard1of1"], "weights": [{"name": "conv2d_1/kernel", "dtype": "float32", "shape": [3, 3, 1, 8]}]}, {"paths": ["group16-shard1of1"], "weights": [{"name": "conv2d_2/kernel", "dtype": "float32", "shape": [3, 3, 8, 8]}]}, {"paths": ["group17-shard1of1"], "weights": [{"name": "conv2d_3/kernel", "dtype": "float32", "shape": [1, 1, 8, 16]}]}, {"paths": ["group18-shard1of1"], "weights": [{"name": "conv2d_4/kernel", "dtype": "float32", "shape": [1, 1, 16, 32]}]}, {"paths": ["group19-shard1of1"], "weights": [{"name": "conv2d_5/kernel", "dtype": "float32", "shape": [1, 1, 32, 64]}]}, {"paths": ["group20-shard1of1"], "weights": [{"name": "conv2d_6/kernel", "dtype": "float32", "shape": [1, 1, 64, 128]}]}, {"paths": ["group21-shard1of1"], "weights": [{"name": "conv2d_7/kernel", "dtype": "float32", "shape": [3, 3, 128, 7]}, {"name": "conv2d_7/bias", "dtype": "float32", "shape": [7]}]}, {"paths": ["group22-shard1of1"], "weights": [{"name": "separable_conv2d_1/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 8, 1]}, {"name": "separable_conv2d_1/pointwise_kernel", "dtype": "float32", "shape": [1, 1, 8, 16]}]}, {"paths": ["group23-shard1of1"], "weights": [{"name": "separable_conv2d_2/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 16, 1]}, {"name": "separable_conv2d_2/pointwise_kernel", "dtype": "float32", "shape": [1, 1, 16, 16]}]}, {"paths": ["group24-shard1of1"], "weights": [{"name": "separable_conv2d_3/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 16, 1]}, {"name": "separable_conv2d_3/pointwise_kernel", "dtype": "float32", "shape": [1, 1, 16, 32]}]}, {"paths": ["group25-shard1of1"], "weights": [{"name": "separable_conv2d_4/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 32, 1]}, {"name": "separable_conv2d_4/pointwise_kernel", "dtype": "float32", "shape": [1, 1, 32, 32]}]}, {"paths": ["group26-shard1of1"], "weights": [{"name": "separable_conv2d_5/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 32, 1]}, {"name": "separable_conv2d_5/pointwise_kernel", "dtype": "float32", "shape": [1, 1, 32, 64]}]}, {"paths": ["group27-shard1of1"], "weights": [{"name": "separable_conv2d_6/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 64, 1]}, {"name": "separable_conv2d_6/pointwise_kernel", "dtype": "float32", "shape": [1, 1, 64, 64]}]}, {"paths": ["group28-shard1of1"], "weights": [{"name": "separable_conv2d_7/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 64, 1]}, {"name": "separable_conv2d_7/pointwise_kernel", "dtype": "float32", "shape": [1, 1, 64, 128]}]}, {"paths": ["group29-shard1of1"], "weights": [{"name": "separable_conv2d_8/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 128, 1]}, {"name": "separable_conv2d_8/pointwise_kernel", "dtype": "float32", "shape": [1, 1, 128, 128]}]}], "modelTopology": {"backend": "tensorflow", "training_config": {"optimizer_config": {"config": {"beta_1": 0.8999999761581421, "decay": 0.0, "amsgrad": false, "epsilon": 1e-07, "lr": 1.000000082740371e-08, "beta_2": 0.9990000128746033}, "class_name": "Adam"}, "loss_weights": null, "metrics": ["accuracy"], "sample_weight_mode": null, "loss": "categorical_crossentropy"}, "keras_version": "2.1.5", "model_config": {"config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "inbound_nodes": [], "config": {"name": "input_1", "batch_input_shape": [null, 64, 64, 1], "sparse": false, "dtype": "float32"}, "class_name": "InputLayer"}, {"name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "activation": "linear", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "kernel_size": [3, 3], "use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "name": "conv2d_1", "activity_regularizer": null, "filters": 8, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "name": "batch_normalization_1", "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "activation": "linear", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "kernel_size": [3, 3], "use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "name": "conv2d_2", "activity_regularizer": null, "filters": 8, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "name": "batch_normalization_2", "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "separable_conv2d_1", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"activation": "linear", "depthwise_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "depthwise_regularizer": null, "pointwise_constraint": null, "activity_regularizer": null, "use_bias": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "pointwise_regularizer": null, "bias_constraint": null, "padding": "same", "name": "separable_conv2d_1", "kernel_size": [3, 3], "pointwise_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "filters": 16, "dilation_rate": [1, 1], "strides": [1, 1], "trainable": true, "data_format": "channels_last", "depthwise_constraint": null, "depth_multiplier": 1}, "class_name": "SeparableConv2D"}, {"name": "batch_normalization_4", "inbound_nodes": [[["separable_conv2d_1", 0, 0, {}]]], "config": {"beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "name": "batch_normalization_4", "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"name": "activation_3", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "separable_conv2d_2", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"activation": "linear", "depthwise_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "depthwise_regularizer": null, "pointwise_constraint": null, "activity_regularizer": null, "use_bias": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "pointwise_regularizer": null, "bias_constraint": null, "padding": "same", "name": "separable_conv2d_2", "kernel_size": [3, 3], "pointwise_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "filters": 16, "dilation_rate": [1, 1], "strides": [1, 1], "trainable": true, "data_format": "channels_last", "depthwise_constraint": null, "depth_multiplier": 1}, "class_name": "SeparableConv2D"}, {"name": "batch_normalization_5", "inbound_nodes": [[["separable_conv2d_2", 0, 0, {}]]], "config": {"beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "name": "batch_normalization_5", "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"name": "conv2d_3", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "kernel_size": [1, 1], "use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "padding": "same", "name": "conv2d_3", "activity_regularizer": null, "filters": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [2, 2], "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"name": "max_pooling2d_1", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "config": {"name": "max_pooling2d_1", "pool_size": [3, 3], "strides": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "same"}, "class_name": "MaxPooling2D"}, {"name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "name": "batch_normalization_3", "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"name": "add_1", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}], ["batch_normalization_3", 0, 0, {}]]], "config": {"name": "add_1", "trainable": true}, "class_name": "Add"}, {"name": "separable_conv2d_3", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"activation": "linear", "depthwise_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "depthwise_regularizer": null, "pointwise_constraint": null, "activity_regularizer": null, "use_bias": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "pointwise_regularizer": null, "bias_constraint": null, "padding": "same", "name": "separable_conv2d_3", "kernel_size": [3, 3], "pointwise_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "filters": 32, "dilation_rate": [1, 1], "strides": [1, 1], "trainable": true, "data_format": "channels_last", "depthwise_constraint": null, "depth_multiplier": 1}, "class_name": "SeparableConv2D"}, {"name": "batch_normalization_7", "inbound_nodes": [[["separable_conv2d_3", 0, 0, {}]]], "config": {"beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "name": "batch_normalization_7", "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"name": "activation_4", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "separable_conv2d_4", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"activation": "linear", "depthwise_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "depthwise_regularizer": null, "pointwise_constraint": null, "activity_regularizer": null, "use_bias": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "pointwise_regularizer": null, "bias_constraint": null, "padding": "same", "name": "separable_conv2d_4", "kernel_size": [3, 3], "pointwise_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "filters": 32, "dilation_rate": [1, 1], "strides": [1, 1], "trainable": true, "data_format": "channels_last", "depthwise_constraint": null, "depth_multiplier": 1}, "class_name": "SeparableConv2D"}, {"name": "batch_normalization_8", "inbound_nodes": [[["separable_conv2d_4", 0, 0, {}]]], "config": {"beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "name": "batch_normalization_8", "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"name": "conv2d_4", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "kernel_size": [1, 1], "use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "padding": "same", "name": "conv2d_4", "activity_regularizer": null, "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [2, 2], "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"name": "max_pooling2d_2", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "config": {"name": "max_pooling2d_2", "pool_size": [3, 3], "strides": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "same"}, "class_name": "MaxPooling2D"}, {"name": "batch_normalization_6", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "name": "batch_normalization_6", "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"name": "add_2", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}], ["batch_normalization_6", 0, 0, {}]]], "config": {"name": "add_2", "trainable": true}, "class_name": "Add"}, {"name": "separable_conv2d_5", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"activation": "linear", "depthwise_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "depthwise_regularizer": null, "pointwise_constraint": null, "activity_regularizer": null, "use_bias": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "pointwise_regularizer": null, "bias_constraint": null, "padding": "same", "name": "separable_conv2d_5", "kernel_size": [3, 3], "pointwise_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "filters": 64, "dilation_rate": [1, 1], "strides": [1, 1], "trainable": true, "data_format": "channels_last", "depthwise_constraint": null, "depth_multiplier": 1}, "class_name": "SeparableConv2D"}, {"name": "batch_normalization_10", "inbound_nodes": [[["separable_conv2d_5", 0, 0, {}]]], "config": {"beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "name": "batch_normalization_10", "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"name": "activation_5", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "separable_conv2d_6", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"activation": "linear", "depthwise_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "depthwise_regularizer": null, "pointwise_constraint": null, "activity_regularizer": null, "use_bias": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "pointwise_regularizer": null, "bias_constraint": null, "padding": "same", "name": "separable_conv2d_6", "kernel_size": [3, 3], "pointwise_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "filters": 64, "dilation_rate": [1, 1], "strides": [1, 1], "trainable": true, "data_format": "channels_last", "depthwise_constraint": null, "depth_multiplier": 1}, "class_name": "SeparableConv2D"}, {"name": "batch_normalization_11", "inbound_nodes": [[["separable_conv2d_6", 0, 0, {}]]], "config": {"beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "name": "batch_normalization_11", "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"name": "conv2d_5", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "kernel_size": [1, 1], "use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "padding": "same", "name": "conv2d_5", "activity_regularizer": null, "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [2, 2], "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"name": "max_pooling2d_3", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "config": {"name": "max_pooling2d_3", "pool_size": [3, 3], "strides": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "same"}, "class_name": "MaxPooling2D"}, {"name": "batch_normalization_9", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "name": "batch_normalization_9", "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"name": "add_3", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}], ["batch_normalization_9", 0, 0, {}]]], "config": {"name": "add_3", "trainable": true}, "class_name": "Add"}, {"name": "separable_conv2d_7", "inbound_nodes": [[["add_3", 0, 0, {}]]], "config": {"activation": "linear", "depthwise_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "depthwise_regularizer": null, "pointwise_constraint": null, "activity_regularizer": null, "use_bias": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "pointwise_regularizer": null, "bias_constraint": null, "padding": "same", "name": "separable_conv2d_7", "kernel_size": [3, 3], "pointwise_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "filters": 128, "dilation_rate": [1, 1], "strides": [1, 1], "trainable": true, "data_format": "channels_last", "depthwise_constraint": null, "depth_multiplier": 1}, "class_name": "SeparableConv2D"}, {"name": "batch_normalization_13", "inbound_nodes": [[["separable_conv2d_7", 0, 0, {}]]], "config": {"beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "name": "batch_normalization_13", "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"name": "activation_6", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "separable_conv2d_8", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "config": {"activation": "linear", "depthwise_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "depthwise_regularizer": null, "pointwise_constraint": null, "activity_regularizer": null, "use_bias": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "pointwise_regularizer": null, "bias_constraint": null, "padding": "same", "name": "separable_conv2d_8", "kernel_size": [3, 3], "pointwise_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "filters": 128, "dilation_rate": [1, 1], "strides": [1, 1], "trainable": true, "data_format": "channels_last", "depthwise_constraint": null, "depth_multiplier": 1}, "class_name": "SeparableConv2D"}, {"name": "batch_normalization_14", "inbound_nodes": [[["separable_conv2d_8", 0, 0, {}]]], "config": {"beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "name": "batch_normalization_14", "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"name": "conv2d_6", "inbound_nodes": [[["add_3", 0, 0, {}]]], "config": {"kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "kernel_size": [1, 1], "use_bias": false, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "padding": "same", "name": "conv2d_6", "activity_regularizer": null, "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [2, 2], "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"name": "max_pooling2d_4", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "config": {"name": "max_pooling2d_4", "pool_size": [3, 3], "strides": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "same"}, "class_name": "MaxPooling2D"}, {"name": "batch_normalization_12", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "name": "batch_normalization_12", "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"name": "add_4", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}], ["batch_normalization_12", 0, 0, {}]]], "config": {"name": "add_4", "trainable": true}, "class_name": "Add"}, {"name": "conv2d_7", "inbound_nodes": [[["add_4", 0, 0, {}]]], "config": {"kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "padding": "same", "name": "conv2d_7", "activity_regularizer": null, "filters": 7, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"name": "global_average_pooling2d_1", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"name": "global_average_pooling2d_1", "trainable": true, "data_format": "channels_last"}, "class_name": "GlobalAveragePooling2D"}, {"name": "predictions", "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]], "config": {"name": "predictions", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "output_layers": [["predictions", 0, 0]]}, "class_name": "Model"}}}